[
    {
        "tweet_text": "Flipkart expands digital payment offerings with new recharge and bill payment categories\nThe new categories include Fastag, DTH recharges, landline, broadband, and mobile postpaid bill payments\nCustomers can redeem offers of up to 10% with SuperCoins by using Flipkart UPI\nRead https://t.co/pxqyUEwUBm",
        "tweet_created_at": "Thu Jul 11 12:19:54 +0000 2024"
    },
    {
        "tweet_text": ".@Flipkart and @VKP_TNRTP signed an MOU at TN-Rise organized by the #TamilNadu govt and @WorldBank to provide market access through e-commerce and training, to women entrepreneurs and craftspeople in the state, empowering them to sell their products across the country.\n\n@mkstalin https://t.co/7uXlKmHrSH",
        "tweet_created_at": "Tue Jul 02 12:28:20 +0000 2024"
    },
    {
        "tweet_text": "AI is set to revolutionise e-commerce with hyper-personalization and recommendations, visual and voice search, dynamic pricing insights, and 24/7 AI-driven support. The future of shopping is here with AI.\n\n#Ecommerce #AI #Innovation #CustomerExperience #FutureTrends https://t.co/vdOOXQxQmd",
        "tweet_created_at": "Tue Jul 02 05:29:55 +0000 2024"
    },
    {
        "tweet_text": ".@Flipkart empowers MSMEs in India and drives significant socio-economic growth by improving customer engagement, cutting costs, and reaching a wider market. FemiSafe challenges menstruation stigmas and reshapes feminine hygiene through community engagement.\n \n#VoicesOfIndia https://t.co/XSXN8kukzd",
        "tweet_created_at": "Mon Jul 01 08:14:36 +0000 2024"
    },
    {
        "tweet_text": ".@Flipkart prioritizes user safety by offering a quiz to test your knowledge of online safety tips. Watch the video to gain valuable insights and find out who wins the prize! \n\n#OnlineSafety #CyberSecurity #Ecommerce #Flipkart #SafetyNet https://t.co/vXrST8Vxqj",
        "tweet_created_at": "Sat Jun 29 08:00:00 +0000 2024"
    },
    {
        "tweet_text": "As online shopping becomes more common, @Flipkart ensures that its customers make safe choices with a safety quiz. Watch the video to learn online safety tips and see who wins the prize!\n#OnlineSafety #CyberSecurity #Ecommerce #Flipkart #SafetyNet https://t.co/RvcJtNXhMS",
        "tweet_created_at": "Sat Jun 29 06:00:04 +0000 2024"
    },
    {
        "tweet_text": "In 2024, @Flipkart's Video Commerce approach made a big impact. The highest viewership for a single Live Commerce video was 1.4 million. Customers enjoyed hours of curated content through on-app videos featuring celebrities and influencers. This year, Flipkart aims to enhance its https://t.co/bkgB0Cx98S",
        "tweet_created_at": "Fri Jun 28 12:37:37 +0000 2024"
    },
    {
        "tweet_text": "Facing academic challenges, Pankaj Khatri embraced his mother Shanti Devi's vision of selling sarees on @Flipkart. Their hopeful venture turned into a thriving business, sustaining their family and employing artisans across Rajasthan. Their story highlights the power of https://t.co/7Nu1RdjCtS",
        "tweet_created_at": "Thu Jun 27 12:43:13 +0000 2024"
    },
    {
        "tweet_text": "Ranjit Shah’s e-commerce journey from Howly, Assam showcases innovation and determination. Leveraging @Flipkart’s platform and identifying market gaps, he scaled his business. Inspired by his mother and supported by family, this self-taught entrepreneur epitomizes young Indian https://t.co/kSPpRuCiNd",
        "tweet_created_at": "Thu Jun 27 07:51:18 +0000 2024"
    },
    {
        "tweet_text": "Warraque Ahmed, a young entrepreneur, is transforming his family’s traditional handloom business by going digital. Through the @Flipkart Samarth program, he supports local artisans and preserves Banarasi saree craftsmanship. With rising online sales, Warraque envisions a vibrant, https://t.co/i95t6C7Xsw",
        "tweet_created_at": "Thu Jun 27 06:45:24 +0000 2024"
    },
    {
        "tweet_text": "RT @rajneeeshkumar: At @Flipkart, our constant endeavour is to make it easy for sellers to access #DigitalMarkets &amp; help in #EaseOfDoingBus…",
        "tweet_created_at": "Thu Jun 27 06:06:51 +0000 2024"
    },
    {
        "tweet_text": ".@Flipkart is enhancing customer experience with Generative AI, aiming to make e-commerce more accessible with upcoming AI features.\n\n#GenAI #UI #UX #DataScience #ArtificialIntelligence https://t.co/7CHuoUZjoF",
        "tweet_created_at": "Wed Jun 26 12:14:07 +0000 2024"
    },
    {
        "tweet_text": "Shopsy's Grand Mela concluded with record demand and many new customers. The event showcased Shopsy's commitment to exceptional value, wide selection, and innovation, driving significant growth and customer satisfaction. \nRead More: https://t.co/JxDV01BiEM\n\n#ShopsyMela https://t.co/xUT9VeQsN2",
        "tweet_created_at": "Wed Jun 26 10:43:59 +0000 2024"
    },
    {
        "tweet_text": "In this clip from Episode 2 of The Culture Code series by @Flipkart, Naren Ravula shares his motivation for working at the company, emphasising the enormous opportunity ahead in driving e-commerce growth in India.\nWatch the full video: https://t.co/tBos92AyPG\n\n#TheCultureCode https://t.co/XseGYdjMfj",
        "tweet_created_at": "Wed Jun 26 08:26:15 +0000 2024"
    },
    {
        "tweet_text": "Joy Das confidently viewed education as his path to independence from a world that felt constricting. It's an inspiring journey, urging others to embrace their true selves.\nRead More: https://t.co/2clr2IZz9w \n\n #SelfDiscovery #PrideMonth #LGBT #Authentic #InspireOthes https://t.co/J9zIxpshTx",
        "tweet_created_at": "Tue Jun 25 10:58:31 +0000 2024"
    },
    {
        "tweet_text": "At @Flipkart, AI is being utilised to enhance the e-commerce experience for sellers. AI-powered recommendations, efficient supply chains, and smarter demand forecasting are just the beginning of a larger reform using AI. \n\n#GenAI #Ecommerce #Innovation #DataScience https://t.co/rfygfzi4OX",
        "tweet_created_at": "Mon Jun 24 12:40:20 +0000 2024"
    },
    {
        "tweet_text": "In this clip from Episode 2 of The Culture Code series by @Flipkart, Naren Ravula emphasises the importance of a culture of innovation for Flipkart's success, highlighting the company's pioneering innovations and the two types of innovation: continuous and breakthrough. \nWatch https://t.co/H2RdK2DyeB",
        "tweet_created_at": "Mon Jun 24 06:20:43 +0000 2024"
    },
    {
        "tweet_text": "RT @FlipkartEnables: For India to become the next superpower, all hands must be on deck. @FlipkartEnables  has undertaken multiple initiati…",
        "tweet_created_at": "Mon Jun 24 06:06:29 +0000 2024"
    },
    {
        "tweet_text": ".@Flipkart hosted a fun Vox pop quiz on safe online practices. Check out the video to see how well people know about online safety tips, and pick up some tips yourself.\n\n#OnlineSafety #CyberSecurity #Ecommerce #Flipkart #SafetyNet https://t.co/RActakJUpc",
        "tweet_created_at": "Fri Jun 21 09:30:18 +0000 2024"
    },
    {
        "tweet_text": "In this clip from Episode 2 of The Culture Code series by @Flipkart, Naren Ravula explains how the company fosters a culture of agility by having full-stack engineers in the Tiger Team who can quickly adapt to the organisation's changing needs. \n\n#TheCultureCode #AgileCulture https://t.co/rTaw6Hw2lO",
        "tweet_created_at": "Fri Jun 21 05:58:45 +0000 2024"
    }
]